adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
  #define NRF_SECURE_CRACENCORE                   NRF_SECURE_CRACENCORE_NS
  #define NRF_SECURE_MEMCONF200                   NRF_SECURE_MEMCONF200_NS
  #define NRF_SECURE_ETM                          NRF_SECURE_ETM_NS
  #define NRF_SECURE_MVDMA                        NRF_SECURE_MVDMA_NS
  #define NRF_SECURE_ROMC                         NRF_SECURE_ROMC_NS
  #define NRF_SECURE_CRACEN                       NRF_SECURE_CRACEN_NS
  #define NRF_SECURE_RAMC001                      NRF_SECURE_RAMC001_NS
  #define NRF_SECURE_PCGCS000                     NRF_SECURE_PCGCS000_NS
  #define NRF_SECURE_HSFLL                        NRF_SECURE_HSFLL_NS
  #define NRF_SECURE_LRCCONF000                   NRF_SECURE_LRCCONF000_NS
  #define NRF_SECURE_PCGCM001                     NRF_SECURE_PCGCM001_NS
  #define NRF_SECURE_CPUCONF                      NRF_SECURE_CPUCONF_NS
  #define NRF_SECURE_MEMCONF                      NRF_SECURE_MEMCONF_NS
  #define NRF_SECURE_WDT010                       NRF_SECURE_WDT010_NS
  #define NRF_SECURE_WDT011                       NRF_SECURE_WDT011_NS
  #define NRF_SECURE_MUTEX                        NRF_SECURE_MUTEX_NS
  #define NRF_SECURE_PCGCS010                     NRF_SECURE_PCGCS010_NS
  #define NRF_SECURE_ABB                          NRF_SECURE_ABB_NS
  #define NRF_SECURE_LRCCONF010                   NRF_SECURE_LRCCONF010_NS
  #define NRF_SECURE_PCGCM011                     NRF_SECURE_PCGCM011_NS
  #define NRF_SECURE_IPCT                         NRF_SECURE_IPCT_NS
  #define NRF_SECURE_SWI0                         NRF_SECURE_SWI0_NS
  #define NRF_SECURE_SWI1                         NRF_SECURE_SWI1_NS
  #define NRF_SECURE_SWI2                         NRF_SECURE_SWI2_NS
  #define NRF_SECURE_SWI3                         NRF_SECURE_SWI3_NS
  #define NRF_SECURE_SWI4                         NRF_SECURE_SWI4_NS
  #define NRF_SECURE_SWI5                         NRF_SECURE_SWI5_NS
  #define NRF_SECURE_SWI6                         NRF_SECURE_SWI6_NS
  #define NRF_SECURE_SWI7                         NRF_SECURE_SWI7_NS
  #define NRF_SECURE_BELLBOARD                    NRF_SECURE_BELLBOARD_NS
  #define NRF_SECURE_MPC200                       NRF_SECURE_MPC200_NS
  #define NRF_SECURE_SPU200                       NRF_SECURE_SPU200_NS
  #define NRF_SECURE_SPU210                       NRF_SECURE_SPU210_NS
  #define NRF_SECURE_CTRLAP                       NRF_SECURE_CTRLAP_NS
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_SECURE_ICACHEDATA                   NRF_SECURE_ICACHEDATA_S
  #define NRF_SECURE_ICACHEINFO                   NRF_SECURE_ICACHEINFO_S
  #define NRF_SECURE_SICR                         NRF_SECURE_SICR_S
  #define NRF_SECURE_RICR                         NRF_SECURE_RICR_S
  #define NRF_SECURE_DCACHEDATA                   NRF_SECURE_DCACHEDATA_S
  #define NRF_SECURE_DCACHEINFO                   NRF_SECURE_DCACHEINFO_S
  #define NRF_SECURE_CRACENCORE                   NRF_SECURE_CRACENCORE_S
  #define NRF_SECURE_MEMCONF200                   NRF_SECURE_MEMCONF200_NS
  #define NRF_SECURE_ETM                          NRF_SECURE_ETM_NS
  #define NRF_SECURE_CTI                          NRF_SECURE_CTI_S
  #define NRF_SECURE_CPUC                         NRF_SECURE_CPUC_S
  #define NRF_SECURE_ICACHE                       NRF_SECURE_ICACHE_S
  #define NRF_SECURE_DCACHE                       NRF_SECURE_DCACHE_S
  #define NRF_SECURE_SPU000                       NRF_SECURE_SPU000_S
  #define NRF_SECURE_MPC000                       NRF_SECURE_MPC000_S
  #define NRF_SECURE_MVDMA                        NRF_SECURE_MVDMA_S
  #define NRF_SECURE_RAMC000                      NRF_SECURE_RAMC000_S
  #define NRF_SECURE_ROMC                         NRF_SECURE_ROMC_S
  #define NRF_SECURE_CRACEN                       NRF_SECURE_CRACEN_S
  #define NRF_SECURE_RAMC001                      NRF_SECURE_RAMC001_S
  #define NRF_SECURE_PCGCS000                     NRF_SECURE_PCGCS000_S
  #define NRF_SECURE_PCGCM000                     NRF_SECURE_PCGCM000_S
  #define NRF_SECURE_HSFLL                        NRF_SECURE_HSFLL_S
  #define NRF_SECURE_LRCCONF000                   NRF_SECURE_LRCCONF000_S
  #define NRF_SECURE_PCGCM001                     NRF_SECURE_PCGCM001_S
  #define NRF_SECURE_SPU010                       NRF_SECURE_SPU010_S
  #define NRF_SECURE_CPUCONF                      NRF_SECURE_CPUCONF_S
  #define NRF_SECURE_MEMCONF                      NRF_SECURE_MEMCONF_S
  #define NRF_SECURE_WDT010                       NRF_SECURE_WDT010_S
  #define NRF_SECURE_WDT011                       NRF_SECURE_WDT011_S
  #define NRF_SECURE_TAMPC                        NRF_SECURE_TAMPC_S
  #define NRF_SECURE_MUTEX                        NRF_SECURE_MUTEX_S
  #define NRF_SECURE_PCGCS010                     NRF_SECURE_PCGCS010_S
  #define NRF_SECURE_PCGCM010                     NRF_SECURE_PCGCM010_S
  #define NRF_SECURE_ABB                          NRF_SECURE_ABB_S
  #define NRF_SECURE_LRCCONF010                   NRF_SECURE_LRCCONF010_S
  #define NRF_SECURE_RESETINFO                    NRF_SECURE_RESETINFO_S
  #define NRF_SECURE_PCGCM011                     NRF_SECURE_PCGCM011_S
  #define NRF_SECURE_IPCT                         NRF_SECURE_IPCT_S
  #define NRF_SECURE_SWI0                         NRF_SECURE_SWI0_NS
  #define NRF_SECURE_SWI1                         NRF_SECURE_SWI1_NS
  #define NRF_SECURE_SWI2                         NRF_SECURE_SWI2_NS
  #define NRF_SECURE_SWI3                         NRF_SECURE_SWI3_NS
  #define NRF_SECURE_SWI4                         NRF_SECURE_SWI4_NS
  #define NRF_SECURE_SWI5                         NRF_SECURE_SWI5_NS
  #define NRF_SECURE_SWI6                         NRF_SECURE_SWI6_NS
  #define NRF_SECURE_SWI7                         NRF_SECURE_SWI7_NS
  #define NRF_SECURE_BELLBOARD                    NRF_SECURE_BELLBOARD_S
  #define NRF_SECURE_MPC200                       NRF_SECURE_MPC200_NS
  #define NRF_SECURE_SPU200                       NRF_SECURE_SPU200_NS
  #define NRF_SECURE_SPU210                       NRF_SECURE_SPU210_NS
  #define NRF_SECURE_CTRLAP                       NRF_SECURE_CTRLAP_NS
  #define NRF_SECURE_SPU110                       NRF_SECURE_SPU110_S
  #define NRF_SECURE_MPC110                       NRF_SECURE_MPC110_S
  #define NRF_SECURE_SPU111                       NRF_SECURE_SPU111_S
  #define NRF_SECURE_MPC111                       NRF_SECURE_MPC111_S
  #define NRF_SECURE_SPU120                       NRF_SECURE_SPU120_S
  #define NRF_SECURE_MPC120                       NRF_SECURE_MPC120_S
  #define NRF_SECURE_SPU121                       NRF_SECURE_SPU121_S
  #define NRF_SECURE_SPU122                       NRF_SECURE_SPU122_S
  #define NRF_SECURE_SPU130                       NRF_SECURE_SPU130_S
  #define NRF_SECURE_MPC130                       NRF_SECURE_MPC130_S
  #define NRF_SECURE_SPU131                       NRF_SECURE_SPU131_S
  #define NRF_SECURE_IPCMAP                       NRF_SECURE_IPCMAP_S
  #define NRF_SECURE_IRQMAP                       NRF_SECURE_IRQMAP_S
  #define NRF_SECURE_SPU132                       NRF_SECURE_SPU132_S
  #define NRF_SECURE_SPU133                       NRF_SECURE_SPU133_S
  #define NRF_SECURE_SPU134                       NRF_SECURE_SPU134_S
  #define NRF_SECURE_SPU135                       NRF_SECURE_SPU135_S
  #define NRF_SECURE_SPU136                       NRF_SECURE_SPU136_S
  #define NRF_SECURE_SPU137                       NRF_SECURE_SPU137_S
#endif                                               /*!< NRF_TRUSTZONE_NONSECURE                                              */

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

#ifdef NRF_SECURE                                    /*!< Remap NRF_DOMAIN_X instances to NRF_X symbol for ease of use.        */
  #ifdef NRF_TRUSTZONE_NONSECURE                     /*!< Remap only nonsecure instances.                                      */
    #define NRF_CRACENCORE                        NRF_SECURE_CRACENCORE
    #define NRF_MEMCONF200                        NRF_SECURE_MEMCONF200
    #define NRF_ETM                               NRF_SECURE_ETM
    #define NRF_MVDMA                             NRF_SECURE_MVDMA
    #define NRF_ROMC                              NRF_SECURE_ROMC
    #define NRF_CRACEN                            NRF_SECURE_CRACEN
    #define NRF_RAMC001                           NRF_SECURE_RAMC001
    #define NRF_PCGCS000                          NRF_SECURE_PCGCS000
    #define NRF_HSFLL                             NRF_SECURE_HSFLL
    #define NRF_LRCCONF000                        NRF_SECURE_LRCCONF000
    #define NRF_PCGCM001                          NRF_SECURE_PCGCM001
    #define NRF_CPUCONF                           NRF_SECURE_CPUCONF
    #define NRF_MEMCONF                           NRF_SECURE_MEMCONF
    #define NRF_WDT010                            NRF_SECURE_WDT010
    #define NRF_WDT011                            NRF_SECURE_WDT011
    #define NRF_MUTEX                             NRF_SECURE_MUTEX
    #define NRF_PCGCS010                          NRF_SECURE_PCGCS010
    #define NRF_ABB                               NRF_SECURE_ABB
    #define NRF_LRCCONF010                        NRF_SECURE_LRCCONF010
    #define NRF_PCGCM011                          NRF_SECURE_PCGCM011
    #define NRF_IPCT                              NRF_SECURE_IPCT
    #define NRF_SWI0                              NRF_SECURE_SWI0
    #define NRF_SWI1                              NRF_SECURE_SWI1
    #define NRF_SWI2                              NRF_SECURE_SWI2
    #define NRF_SWI3                              NRF_SECURE_SWI3
    #define NRF_SWI4                              NRF_SECURE_SWI4
    #define NRF_SWI5                              NRF_SECURE_SWI5
    #define NRF_SWI6                              NRF_SECURE_SWI6
    #define NRF_SWI7                              NRF_SECURE_SWI7
    #define NRF_BELLBOARD                         NRF_SECURE_BELLBOARD
    #define NRF_MPC200                            NRF_SECURE_MPC200
    #define NRF_SPU200                            NRF_SECURE_SPU200
    #define NRF_SPU210                            NRF_SECURE_SPU210
    #define NRF_CTRLAP                            NRF_SECURE_CTRLAP
  #else                                              /*!< Remap all instances.                                                 */
    #define NRF_ICACHEDATA                        NRF_SECURE_ICACHEDATA
    #define NRF_ICACHEINFO                        NRF_SECURE_ICACHEINFO
    #define NRF_SICR                              NRF_SECURE_SICR
    #define NRF_RICR                              NRF_SECURE_RICR
    #define NRF_DCACHEDATA                        NRF_SECURE_DCACHEDATA
    #define NRF_DCACHEINFO                        NRF_SECURE_DCACHEINFO
    #define NRF_CRACENCORE                        NRF_SECURE_CRACENCORE
    #define NRF_MEMCONF200                        NRF_SECURE_MEMCONF200
    #define NRF_ETM                               NRF_SECURE_ETM
    #define NRF_CTI                               NRF_SECURE_CTI
    #define NRF_CPUC                              NRF_SECURE_CPUC
    #define NRF_ICACHE                            NRF_SECURE_ICACHE
    #define NRF_DCACHE                            NRF_SECURE_DCACHE
    #define NRF_SPU000                            NRF_SECURE_SPU000
    #define NRF_MPC000                            NRF_SECURE_MPC000
    #define NRF_MVDMA                             NRF_SECURE_MVDMA
    #define NRF_RAMC000                           NRF_SECURE_RAMC000
    #define NRF_ROMC                              NRF_SECURE_ROMC
    #define NRF_CRACEN                            NRF_SECURE_CRACEN
    #define NRF_RAMC001                           NRF_SECURE_RAMC001
    #define NRF_PCGCS000                          NRF_SECURE_PCGCS000
    #define NRF_PCGCM000                          NRF_SECURE_PCGCM000
    #define NRF_HSFLL                             NRF_SECURE_HSFLL
    #define NRF_LRCCONF000                        NRF_SECURE_LRCCONF000
    #define NRF_PCGCM001                          NRF_SECURE_PCGCM001
    #define NRF_SPU010                            NRF_SECURE_SPU010
    #define NRF_CPUCONF                           NRF_SECURE_CPUCONF
    #define NRF_MEMCONF                           NRF_SECURE_MEMCONF
    #define NRF_WDT010                            NRF_SECURE_WDT010
    #define NRF_WDT011                            NRF_SECURE_WDT011
    #define NRF_TAMPC                             NRF_SECURE_TAMPC
    #define NRF_MUTEX                             NRF_SECURE_MUTEX
    #define NRF_PCGCS010                          NRF_SECURE_PCGCS010
    #define NRF_PCGCM010                          NRF_SECURE_PCGCM010
    #define NRF_ABB                               NRF_SECURE_ABB
    #define NRF_LRCCONF010                        NRF_SECURE_LRCCONF010
    #define NRF_RESETINFO                         NRF_SECURE_RESETINFO
    #define NRF_PCGCM011                          NRF_SECURE_PCGCM011
    #define NRF_IPCT                              NRF_SECURE_IPCT
    #define NRF_SWI0                              NRF_SECURE_SWI0
    #define NRF_SWI1                              NRF_SECURE_SWI1
    #define NRF_SWI2                              NRF_SECURE_SWI2
    #define NRF_SWI3                              NRF_SECURE_SWI3
    #define NRF_SWI4                              NRF_SECURE_SWI4
    #define NRF_SWI5                              NRF_SECURE_SWI5
    #define NRF_SWI6                              NRF_SECURE_SWI6
    #define NRF_SWI7                              NRF_SECURE_SWI7
    #define NRF_BELLBOARD                         NRF_SECURE_BELLBOARD
    #define NRF_MPC200                            NRF_SECURE_MPC200
    #define NRF_SPU200                            NRF_SECURE_SPU200
    #define NRF_SPU210                            NRF_SECURE_SPU210
    #define NRF_CTRLAP                            NRF_SECURE_CTRLAP
    #define NRF_SPU110                            NRF_SECURE_SPU110
    #define NRF_MPC110                            NRF_SECURE_MPC110
    #define NRF_SPU111                            NRF_SECURE_SPU111
    #define NRF_MPC111                            NRF_SECURE_MPC111
    #define NRF_SPU120                            NRF_SECURE_SPU120
    #define NRF_MPC120                            NRF_SECURE_MPC120
    #define NRF_SPU121                            NRF_SECURE_SPU121
    #define NRF_SPU122                            NRF_SECURE_SPU122
    #define NRF_SPU130                            NRF_SECURE_SPU130
    #define NRF_MPC130                            NRF_SECURE_MPC130
    #define NRF_SPU131                            NRF_SECURE_SPU131
    #define NRF_IPCMAP                            NRF_SECURE_IPCMAP
    #define NRF_IRQMAP                            NRF_SECURE_IRQMAP
    #define NRF_SPU132                            NRF_SECURE_SPU132
    #define NRF_SPU133                            NRF_SECURE_SPU133
    #define NRF_SPU134                            NRF_SECURE_SPU134
    #define NRF_SPU135                            NRF_SECURE_SPU135
    #define NRF_SPU136                            NRF_SECURE_SPU136
    #define NRF_SPU137                            NRF_SECURE_SPU137
  #endif                                             /*!< NRF_TRUSTZONE_NONSECURE                                              */
#endif                                               /*!< NRF_SECURE                                                           */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGB_SECURE_H */

